; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob70) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate9)
	(at pallet1 distributor0)
	(clear crate6)
	(at pallet2 distributor1)
	(clear crate10)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 418)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 319)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 52)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 11)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 91)
	(at crate3 distributor0)
	(on crate3 crate0)
	(= (weight crate3) 54)
	(at crate4 distributor1)
	(on crate4 crate2)
	(= (weight crate4) 78)
	(at crate5 depot0)
	(on crate5 crate1)
	(= (weight crate5) 37)
	(at crate6 distributor0)
	(on crate6 crate3)
	(= (weight crate6) 64)
	(at crate7 distributor1)
	(on crate7 crate4)
	(= (weight crate7) 27)
	(at crate8 distributor1)
	(on crate8 crate7)
	(= (weight crate8) 51)
	(at crate9 depot0)
	(on crate9 crate5)
	(= (weight crate9) 80)
	(at crate10 distributor1)
	(on crate10 crate8)
	(= (weight crate10) 50)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet2)
		(on crate2 pallet0)
		(on crate3 crate5)
		(on crate4 crate2)
		(on crate5 crate6)
		(on crate6 crate4)
		(on crate7 pallet1)
		(on crate10 crate0)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist0 crate9 crate5 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate5)
   added: (lifting hoist0 crate9) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 9
2. (lift hoist2 crate10 crate8 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate8)
   added: (lifting hoist2 crate10) (clear crate8)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 9
3. (load hoist2 crate10 truck0 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 50
   goals met: 1 of 9
4. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 9
5. (load hoist0 crate9 truck0 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck0) (available hoist0)
   changed: (current_load truck0) from 50 to 130
   goals met: 1 of 9
6. (lift hoist0 crate5 crate1 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate1)
   added: (lifting hoist0 crate5) (clear crate1)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 9
7. (lift hoist2 crate8 crate7 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate7)
   added: (lifting hoist2 crate8) (clear crate7)
   changed: (fuel-cost) from 13 to 14
   goals met: 1 of 9
8. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 130 to 167
   goals met: 1 of 9
9. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 14 to 15
   goals met: 1 of 9
10. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 15 to 25
   goals met: 1 of 9
11. (drop hoist2 crate8 crate7 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate7)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate7)
   goals met: 1 of 9
12. (drop hoist0 crate1 pallet0 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet0)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 pallet0)
   goals met: 1 of 9
13. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 167 to 130
   goals met: 1 of 9
14. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 25 to 35
   goals met: 1 of 9
15. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 35 to 36
   goals met: 1 of 9
16. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 130 to 141
   goals met: 1 of 9
17. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 36 to 46
   goals met: 1 of 9
18. (drop hoist1 crate5 crate6 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate6)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate6)
   goals met: 2 of 9
19. (lift hoist2 crate8 crate7 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate7)
   added: (lifting hoist2 crate8) (clear crate7)
   changed: (fuel-cost) from 46 to 47
   goals met: 2 of 9
20. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 47 to 57
   goals met: 2 of 9
21. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 51
   goals met: 2 of 9
22. (lift hoist2 crate7 crate4 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate4)
   added: (lifting hoist2 crate7) (clear crate4)
   changed: (fuel-cost) from 57 to 58
   goals met: 2 of 9
23. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 58 to 68
   goals met: 2 of 9
24. (load hoist2 crate7 truck0 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 141 to 168
   goals met: 2 of 9
25. (lift hoist2 crate4 crate2 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate2)
   added: (lifting hoist2 crate4) (clear crate2)
   changed: (fuel-cost) from 68 to 69
   goals met: 1 of 9
26. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 168 to 246
   goals met: 1 of 9
27. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 69 to 70
   goals met: 1 of 9
28. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 70 to 80
   goals met: 1 of 9
29. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   changed: (current_load truck1) from 51 to 142
   goals met: 1 of 9
30. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 80 to 90
   goals met: 1 of 9
31. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck1) from 142 to 51
   goals met: 1 of 9
32. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 2 of 9
33. (unload hoist1 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck0) from 246 to 235
   goals met: 2 of 9
34. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 90 to 100
   goals met: 2 of 9
35. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 235 to 157
   goals met: 2 of 9
36. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 100 to 110
   goals met: 2 of 9
37. (drop hoist1 crate1 crate5 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate5)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 crate5)
   goals met: 2 of 9
38. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 157 to 130
   goals met: 2 of 9
39. (drop hoist1 crate7 crate1 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate1)
   goals met: 2 of 9
40. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 110 to 120
   goals met: 2 of 9
41. (drop hoist0 crate4 crate2 depot0)
   deleted: (lifting hoist0 crate4) (clear crate2)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate2)
   goals met: 3 of 9
42. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 120 to 130
   goals met: 3 of 9
43. (lift hoist1 crate7 crate1 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate1)
   added: (lifting hoist1 crate7) (clear crate1)
   changed: (fuel-cost) from 130 to 131
   goals met: 3 of 9
44. (load hoist1 crate7 truck1 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   changed: (current_load truck1) from 51 to 78
   goals met: 3 of 9
45. (lift hoist1 crate1 crate5 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate5)
   added: (lifting hoist1 crate1) (clear crate5)
   changed: (fuel-cost) from 131 to 132
   goals met: 3 of 9
46. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   changed: (current_load truck1) from 78 to 89
   goals met: 3 of 9
47. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 132 to 142
   goals met: 3 of 9
48. (lift hoist1 crate5 crate6 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate6)
   added: (lifting hoist1 crate5) (clear crate6)
   changed: (fuel-cost) from 142 to 143
   goals met: 2 of 9
49. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 130 to 167
   goals met: 2 of 9
50. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 143 to 153
   goals met: 2 of 9
51. (lift hoist1 crate6 crate3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate3)
   added: (lifting hoist1 crate6) (clear crate3)
   changed: (fuel-cost) from 153 to 154
   goals met: 2 of 9
52. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 167 to 231
   goals met: 2 of 9
53. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 89 to 78
   goals met: 2 of 9
54. (drop hoist2 crate1 pallet2 distributor1)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 pallet2)
   goals met: 3 of 9
55. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 231 to 194
   goals met: 3 of 9
56. (drop hoist1 crate5 crate3 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate3)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate3)
   goals met: 3 of 9
57. (lift hoist2 crate1 pallet2 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   changed: (fuel-cost) from 154 to 155
   goals met: 2 of 9
58. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 194 to 144
   goals met: 2 of 9
59. (drop hoist1 crate10 crate5 distributor0)
   deleted: (lifting hoist1 crate10) (clear crate5)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 crate5)
   goals met: 2 of 9
60. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 78 to 89
   goals met: 2 of 9
61. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 155 to 165
   goals met: 2 of 9
62. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 165 to 175
   goals met: 2 of 9
63. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 144 to 80
   goals met: 2 of 9
64. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 175 to 185
   goals met: 2 of 9
65. (lift hoist1 crate10 crate5 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist1) (on crate10 crate5)
   added: (lifting hoist1 crate10) (clear crate5)
   changed: (fuel-cost) from 185 to 186
   goals met: 2 of 9
66. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 186 to 196
   goals met: 2 of 9
67. (load hoist1 crate10 truck0 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   changed: (current_load truck0) from 80 to 130
   goals met: 2 of 9
68. (drop hoist0 crate6 crate4 depot0)
   deleted: (lifting hoist0 crate6) (clear crate4)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate4)
   goals met: 3 of 9
69. (lift hoist1 crate5 crate3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate3)
   added: (lifting hoist1 crate5) (clear crate3)
   changed: (fuel-cost) from 196 to 197
   goals met: 3 of 9
70. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 130 to 167
   goals met: 3 of 9
71. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 167 to 117
   goals met: 3 of 9
72. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 89 to 78
   goals met: 3 of 9
73. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 197 to 207
   goals met: 3 of 9
74. (load hoist1 crate10 truck1 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   changed: (current_load truck1) from 78 to 128
   goals met: 3 of 9
75. (drop hoist2 crate1 pallet2 distributor1)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 pallet2)
   goals met: 4 of 9
76. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 117 to 80
   goals met: 4 of 9
77. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 207 to 217
   goals met: 4 of 9
78. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 128 to 165
   goals met: 4 of 9
79. (lift hoist1 crate3 crate0 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate0)
   added: (lifting hoist1 crate3) (clear crate0)
   changed: (fuel-cost) from 217 to 218
   goals met: 4 of 9
80. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   changed: (current_load truck1) from 165 to 219
   goals met: 4 of 9
81. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 218 to 228
   goals met: 4 of 9
82. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck1) from 219 to 182
   goals met: 4 of 9
83. (drop hoist0 crate5 crate6 depot0)
   deleted: (lifting hoist0 crate5) (clear crate6)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate6)
   goals met: 5 of 9
84. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck1) from 182 to 128
   goals met: 5 of 9
85. (drop hoist0 crate3 crate5 depot0)
   deleted: (lifting hoist0 crate3) (clear crate5)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate5)
   goals met: 6 of 9
86. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 228 to 238
   goals met: 6 of 9
87. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 238 to 239
   goals met: 6 of 9
88. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   changed: (current_load truck1) from 128 to 180
   goals met: 6 of 9
89. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 239 to 249
   goals met: 6 of 9
90. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck1) from 180 to 128
   goals met: 6 of 9
91. (drop hoist2 crate0 crate1 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate1)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate1)
   goals met: 7 of 9
92. (unload hoist2 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist2)
   added: (lifting hoist2 crate10)
   changed: (current_load truck1) from 128 to 78
   goals met: 7 of 9
93. (drop hoist2 crate10 crate0 distributor1)
   deleted: (lifting hoist2 crate10) (clear crate0)
   added: (available hoist2) (at crate10 distributor1) (clear crate10) (on crate10 crate0)
   goals met: 8 of 9
94. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 249 to 259
   goals met: 8 of 9
95. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck1) from 78 to 51
   goals met: 8 of 9
96. (drop hoist1 crate7 pallet1 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 pallet1)
   goals met: 9 of 9
